# Prueba Final Data Science Desafio Latam

In [1]:
# Importamos las librerias necesarias para desarrollar la prueba
import pandas as pd
import psycopg2
import sqlalchemy

In [2]:
# Nos conectamos a la base de datos 'classicmodels' ingresando las credenciales.
db_url = "postgresql://postgres:cesar78@localhost:5432/classicmodels"

In [3]:
# Creamos el motor de conexion
from sqlalchemy import create_engine
engine = create_engine(db_url)

### 1. Genera una función llamada leer_tabla(tabla, engine) y utilízala para leer tablas
### completas desde la base de datos en dataframes independientes. Utilizando esta
### función, importa las siguientes tablas:

In [4]:
# Definimos la funcion 'leer tabla' con los parametros 'tabla' y 'engine'
# Esta funcion me devuelve un DataFrame de Pandas,
def leer_tabla(tabla, engine):
    query = f"SELECT * FROM {tabla}"
    return pd.read_sql(query, engine)

In [5]:
# Finalmente generamos los DataFrames requeridos.
order_df = leer_tabla('orders', engine)
orderdetails_df = leer_tabla('orderdetails', engine)
customers_df = leer_tabla('customers', engine)
products_df = leer_tabla('products', engine)
employees_df = leer_tabla('employees', engine)

In [6]:
# Consultamos los primeros 5 registros del DataFrame order_df
order_df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,None,141

In [7]:
# Consultamos los primeros 5 registros del DataFrame orderdetails_df
orderdetails_df.head()

   orderNumber productCode  quantityOrdered  priceEach  orderLineNumber
0        10100    S18_1749               30     136.00                3
1        10100    S18_2248               50      55.09                2
2        10100    S18_4409               22      75.46                4
3        10100    S24_3969               49      35.29                1
4        10101    S18_2325               25     108.06                4

In [8]:
# Consultamos los primeros 5 registros del DataFrame products_df
products_df.head()

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,Turnable front wheels; steering function; deta...,7305,98.58,214.30
2,S10_2016,1996 Moto Guzzi 1100i,Motorcycles,1:10,Highway 66 Mini Classics,"Official Moto Guzzi logos and insignias, saddl...",6625,68.99,118.94
3,S10_4698,2003 Harley-Davidson Eagle Drag Bike,Motorcycles,1:10,Red Start Diecast,"Model features, official Harley Davidson logos...",5582,91.02,193.66
4,S10_4757,1972 Alfa Romeo GTA,Classic Cars,1:10,Motor City Art Classics,Features include: Turnable front wheels; steer...,3252,85.68,136.00

In [9]:
# Consultamos los primeros 5 registros del DataFrame employees_df
employees_df.head()

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)

In [10]:
# Consultamos los primeros 5 registros del DataFrame customers_df
customers_df.head()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.0
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166.0,71800.0
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.0
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370.0,118200.0
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,None,Stavern,None,4110,Norway,1504.0,81700.0

### 2. Realiza el cruce entre los DataFrames, asegurándote de utilizar correctamente el
### parámetro validate para asegurar la integridad referencia

In [11]:
# Realizamos un merge entre todos los DataFrame para crear nuestro DataFrame 'df_base'
df_base = order_df.\
    merge(orderdetails_df, on ='orderNumber', validate='one_to_many').\
    merge(customers_df, on ='customerNumber',validate='many_to_one').\
    merge(products_df, on ='productCode', validate='many_to_one').\
    merge(employees_df, left_on='salesRepEmployeeNumber', right_on='employeeNumber', validate='many_to_one')
df_base.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber,productCode,quantityOrdered,priceEach,...,buyPrice,MSRP,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363,S18_1749,30,136.00,...,86.70,170.00,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363,S18_2248,50,55.09,...,33.30,60.54,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363,S18_4409,22,75.46,...,43.26,92.03,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363,S24_3969,49,35.29,...,21.75,41.03,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
4,10192,2003-11-20,2003-11-29,2003-11-25,Shipped,None,363,S12_4675,27,99.04,...,58.73,115.16,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep

### 3. Agrega las siguientes columnas, considerando su nombre y la fórmula asociada
- venta: quantityOrdered*priceEach
- costo: quantityOrdered*buyPrice
- ganancia: considerando las columnas anteriores

In [12]:
# Creamos las columnas nuevas segun lo indicado y las revisamos
df_base['venta'] = df_base['quantityOrdered'] * df_base['priceEach']
df_base['costo'] = df_base['quantityOrdered'] * df_base['buyPrice']
df_base['ganancia'] = df_base['venta'] - df_base['costo']
df_base.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber,productCode,quantityOrdered,priceEach,...,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,venta,costo,ganancia
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363,S18_1749,30,136.00,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,4080.00,2601.00,1479.00
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363,S18_2248,50,55.09,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,2754.50,1665.00,1089.50
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363,S18_4409,22,75.46,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,1660.12,951.72,708.40
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363,S24_3969,49,35.29,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,1729.21,1065.75,663.46
4,10192,2003-11-20,2003-11-29,2003-11-25,Shipped,None,363,S12_4675,27,99.04,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,2674.08,1585.71,1088.37

### 4. ¿Cuál fue el total de ventas por línea de productos? Incluye una fila de totales.

In [13]:
# Confeccionamos la pivot table solicitada.
pd.pivot_table(data=df_base,
               values='venta',
               index='productLine', 
               aggfunc='sum',
               margins=True,
               margins_name='Total',
               fill_value=0)

                       venta
productLine
Classic Cars      3853922.49
Motorcycles       1121426.12
Planes             954637.54
Ships              663998.34
Trains             188532.92
Trucks and Buses  1024113.57
Vintage Cars      1797559.63
Total             9604190.61

### 5. ¿Cuántos clientes distintos hicieron compras?

In [14]:
# Contamos la cantidad de clientes que ya han comprado, contando solo una vez cada cliente
customer_unicos = df_base['customerNumber'].nunique()
print(f'La cantidad de clientes que hicieron compras es {customer_unicos}')

La cantidad de clientes que hicieron compras es 98

### 6. ¿Existen clientes que aún no han hecho ninguna compra? ¿Cuántos son?

In [15]:
# Restamos a los clientes totales la cantidad de clientes que ya han comprado
costumer_no_compran = customers_df['customerNumber'].nunique()-df_base['customerNumber'].nunique()
print(f'La cantidad de clientes que aun no han comprado {costumer_no_compran}')

La cantidad de clientes que aun no han comprado 24

### 7. Se solicita la creación de dos reportes, que respondan las preguntas dadas
- ¿Cuáles fueron los 10 clientes que reportan mayores ventas brutas en dinero durante
el año 2005? Genera un DataFrame y guárdalo en una tabla de Postgre llamada
top_10_clientes_2005, en la que se especifique el nombre del cliente y su
correspondiente venta, costo y ganancia.

### Para este punto debes aplicar el principio DRY, por lo que se deben utilizar funciones para
### realizar el filtrado por fechas, generar tablas pivote y escribir tabla en Postgre. Las funciones
### deben estar en un archivo separado llamado funciones.py y ser importadas al Jupyter
### Notebook. En este archivo se debe incluir:
- Una función que permita filtrar un DataFrame por fechas, indicando dataframe,
columna para filtrar, fecha inicio y fecha fin. La función debe retornar un DataFrame.

In [16]:
# Creamos un DataFrame que solo contenga las ventas de ahno 2025 con la funcion creada 'filtrar_por_tabla'
from funciones import filtrar_por_fecha
ventas_2005 = filtrar_por_fecha(df_base, 'orderDate', '2005-01-01', '2020-12-31')
ventas_2005.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber,productCode,quantityOrdered,priceEach,...,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,venta,costo,ganancia
45,10422,2005-05-30,2005-06-11,None,In Process,None,157,S18_1342,51,91.44,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,4663.44,3091.62,1571.82
47,10422,2005-05-30,2005-06-11,None,In Process,None,157,S18_1367,25,47.44,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,1186.00,606.50,579.50
69,10388,2005-03-03,2005-03-11,2005-03-09,Shipped,None,462,S10_1678,42,80.39,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,3376.38,2050.02,1326.36
72,10388,2005-03-03,2005-03-11,2005-03-09,Shipped,None,462,S10_4698,21,156.86,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,3294.06,1911.42,1382.64
75,10388,2005-03-03,2005-03-11,2005-03-09,Shipped,None,462,S12_2823,44,125.01,...,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep,5500.44,2915.88,2584.56

- Una función que permita generar reportes dependiendo de parámetros de entrada
como dataframe, filas, columnas, valores y medida (funcion_agrupadora). Utilizar
fill_value = 0. Esta función debe retornar un DataFrame pivotado.

In [17]:
# Creamos un DataFrame con la suma de las columnas 'venta', 'costo' y 'ganancia' agrupados por 'customerName' con la funcion 'generar_reporte'
from funciones import generar_reporte
clientes_ventas = generar_reporte(ventas_2005,
                                  filas= 'customerName',
                                  valores=['venta', 'costo', 'ganancia'],
                                  medida='sum')
                                
clientes_ventas

                                   venta      costo   ganancia
customerName
Alpha Cognac                    12432.32    7648.14    4784.18
Anna's Decorations, Ltd         56932.30   35414.90   21517.40
Australian Collectables, Ltd    10945.26    7137.13    3808.13
Australian Gift Network, Co     21432.31   12666.83    8765.48
Auto Canal+ Petit               12190.85    6639.08    5551.77
Boards & Toys Co.                3452.75    2630.60     822.15
Collectables For Less Inc.      28322.83   17163.18   11159.65
Corporate Gift Ideas Co.        46781.66   28561.31   18220.35
Danish Wholesale Imports        21638.62   13641.23    7997.39
Diecast Classics Inc.            5849.44    3698.12    2151.32
Down Under Souveniers, Inc      75020.13   46389.52   28630.61
Dragon Souveniers, Ltd.          3516.04    2944.48     571.56
Euro+ Shopping Channel         290018.52  169989.97  120028.55
Extreme Desk Decorations, Ltd   23627.44   13798.24    9829.20
FunGiftIdeas.com                30293.77   17532.54   12761.23
Gift Depot Inc.                 28500.78   16515.27   11985.51
Gifts4AllAges.com               50806.85   33221.25   17585.60
GiftsForHim.com                 36442.34   21857.14   14585.20
Handji Gifts& Co                 2326.18    1727.65     598.53
Kelly's Gift Shop               30253.75   17897.08   12356.67
L'ordine Souveniers             35362.26   22862.59   12499.67
La Rochelle Gifts               91147.11   55527.04   35620.07
Lyon Souveniers                 17928.09   10724.62    7203.47
Marseille Mini Autos             1834.56    1158.72     675.84
Mini Auto Werke                  8807.12    5103.85    3703.27
Mini Caravy                     35157.75   21503.29   13654.46
Mini Creations Ltd.              8307.28    5243.64    3063.64
Mini Gifts Distributors Ltd.   192481.73  115084.72   77397.01
Oulu Toy Supplies, Inc.         46770.52   27493.61   19276.91
Petit Auto                       8597.73    5765.41    2832.32
Québec Home Shopping Network    29070.38   18351.12   10719.26
Reims Collectables              46656.94   28889.40   17767.54
Royale Belge                    14379.90    8622.10    5757.80
Salzburg Collectables           52420.07   33536.26   18883.81
Scandinavian Gift Ideas         27966.54   16420.72   11545.82
Souveniers And Things Co.       42251.51   25731.54   16519.97
Suominen Souveniers             45785.34   29109.51   16675.83
Technics Stores Inc.            12692.19    7060.67    5631.52
Tekni Collectables Inc.         43525.04   28493.70   15031.34
The Sharp Gifts Warehouse       83984.89   50843.02   33141.87
Tokyo Collectables, Ltd         34583.18   22739.71   11843.47
Toys of Finland, Co.            23602.90   14714.47    8888.43
Toys4GrownUps.com               39580.60   21887.81   17692.79
UK Collectables, Ltd.           37258.94   21119.36   16139.58

In [18]:
# Ordenamos de forma descendente por suma de venta y restringimos la consulta a 10 resultados.
top_10_clientes = clientes_ventas.sort_values(by='venta', ascending=False).head(10)
top_10_clientes = top_10_clientes.reset_index(drop=True)
top_10_clientes

       venta      costo   ganancia
0  290018.52  169989.97  120028.55
1  192481.73  115084.72   77397.01
2   91147.11   55527.04   35620.07
3   83984.89   50843.02   33141.87
4   75020.13   46389.52   28630.61
5   56932.30   35414.90   21517.40
6   52420.07   33536.26   18883.81
7   50806.85   33221.25   17585.60
8   46781.66   28561.31   18220.35
9   46770.52   27493.61   19276.91

In [19]:
# Guardamos el DataFrame en una tabla postgres con el nombre 'top_10_clientes_2005'
from funciones import escribir_en_base_de_datos
escribir_en_base_de_datos(top_10_clientes, 'top_10_clientes_2005', engine)

Datos escritos correctamente en la tabla 'top_10_clientes_2005'.

- ¿Cuál fue el top 10 de artículos más vendidos durante el año 2005 (considerando
cantidad neta)? Genera un DataFrame y guárdalo en una tabla de Postgre llamada
top_10_productos_2005, en la que se especifique el nombre del producto y su
correspondiente venta, costo y ganancia.

In [20]:
# Creamos el DataFrame 'productos_mas_vendidos' con la funcion 'groupby' por 'productName' y sumamos la cantidad de ordenes, venta, costo y ganancia
from funciones import generar_reporte
productos_mas_vendidos = generar_reporte(ventas_2005,
                                  filas= 'productName',
                                  valores=['quantityOrdered','venta', 'costo', 'ganancia'],
                                  medida='sum')
productos_mas_vendidos

,quantityOrdered,venta,costo,ganancia
productName,,,,
18th Century Vintage Horse Carriage,140,13110.81,8503.60,4607.21
18th century schooner,157,16561.87,12927.38,3634.49
1900s Vintage Bi-Plane,150,8756.75,5137.50,3619.25
1900s Vintage Tri-Plane,238,15940.74,8622.74,7318.00
1903 Ford Model A,126,16233.55,8605.80,7627.75
...,...,...,...,...
The Mayflower,159,11506.70,6884.70,4622.00
The Queen Mary,143,11771.98,7669.09,4102.89
The Schooner Bluenose,145,8814.00,4930.00,3884.00
The Titanic,155,13433.86,7918.95,5514.91
The USS Constitution Ship,131,8620.13,4450.07,4170.06

In [21]:
# Ordenamos por cantidad de articulos vendidos y limitamos la consulta a 10 resultados
top_10_productos_2005 = productos_mas_vendidos.sort_values(by='quantityOrdered', ascending=False).head(10)
top_10_productos_2005 = top_10_productos_2005.reset_index(drop=True)
top_10_productos_2005

   quantityOrdered     venta     costo  ganancia
0              347  52978.28  27031.30  25946.98
1              272  29567.27  15974.56  13592.71
2              271  28747.69  16493.06  12254.63
3              257  22469.91  17198.44   5271.47
4              255  31432.14  25066.50   6365.64
5              242  16049.47   9031.44   7018.03
6              238  15940.74   8622.74   7318.00
7              231  30434.09  15308.37  15125.72
8              230  26139.34  15867.70  10271.64
9              226  20918.96  14595.08   6323.88

In [22]:
# Creamos la tabla 'top_10_productos_2005' y la guardamos como una tabla postgres
escribir_en_base_de_datos(top_10_clientes, 'top_10_productos_2005', engine)
top_10_productos_2005

Datos escritos correctamente en la tabla 'top_10_productos_2005'.

   quantityOrdered     venta     costo  ganancia
0              347  52978.28  27031.30  25946.98
1              272  29567.27  15974.56  13592.71
2              271  28747.69  16493.06  12254.63
3              257  22469.91  17198.44   5271.47
4              255  31432.14  25066.50   6365.64
5              242  16049.47   9031.44   7018.03
6              238  15940.74   8622.74   7318.00
7              231  30434.09  15308.37  15125.72
8              230  26139.34  15867.70  10271.64
9              226  20918.96  14595.08   6323.88